disks/runtime.4k_randread/90.log
job: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.7
Starting 1 process

job: (groupid=0, jobs=1): err= 0: pid=223889: Tue Aug 11 17:21:53 2020
   read: IOPS=246, BW=984KiB/s (1008kB/s)(86.5MiB/90001msec)
    slat (usec): min=10, max=220, avg=34.57, stdev=12.37
    clat (usec): min=4, max=46069, avg=4022.35, stdev=3126.33
     lat (usec): min=43, max=46130, avg=4057.70, stdev=3126.49
    clat percentiles (usec):
     |  1.00th=[   35],  5.00th=[   36], 10.00th=[   43], 20.00th=[   44],
     | 30.00th=[ 1729], 40.00th=[ 2835], 50.00th=[ 3949], 60.00th=[ 5080],
     | 70.00th=[ 6194], 80.00th=[ 7308], 90.00th=[ 8455], 95.00th=[ 8979],
     | 99.00th=[ 9503], 99.50th=[ 9503], 99.90th=[ 9896], 99.95th=[10028],
     | 99.99th=[17171]
   bw (  KiB/s): min=  816, max= 1144, per=100.00%, avg=984.09, stdev=62.58, samples=180
   iops        : min=  204, max=  286, avg=246.02, stdev=15.64, samples=180
  lat (usec)   : 10=0.04%, 20=0.03%, 50=22.93%, 100=0.88%, 250=1.06%
  lat (usec)   : 500=0.01%, 1000=0.17%
  lat (msec)   : 2=7.51%, 4=17.76%, 10=49.59%, 20=0.04%, 50=0.01%
  cpu          : usr=0.37%, sys=0.96%, ctx=22120, majf=0, minf=11
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=22144,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=984KiB/s (1008kB/s), 984KiB/s-984KiB/s (1008kB/s-1008kB/s), io=86.5MiB (90.7MB), run=90001-90001msec

Disk stats (read/write):
  sdd: ios=22124/0, merge=0/0, ticks=88922/0, in_queue=80380, util=20.29%